In [2]:
import pandas as pd

In [3]:
import pandas as pd

# Sample dictionary
data = {
    "Name": ["Alice", "Bob", "Charlie", "Diana"],
    "Age": [25, 30, 35, 28],
    "City": ["New York", "San Francisco", "Chicago", "Los Angeles"],
    "Employed": [True, False, True, True]
}

# Convert to DataFrame
df = pd.DataFrame(data)

# Display the DataFrame
print(df)

      Name  Age           City  Employed
0    Alice   25       New York      True
1      Bob   30  San Francisco     False
2  Charlie   35        Chicago      True
3    Diana   28    Los Angeles      True

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      4 non-null      object
 1   Age       4 non-null      int64
 2   City      4 non-null      object
 3   Employed  4 non-null      bool
dtypes: bool(1), int64(1), object(2)
memory usage: 232.0+ bytes

In [5]:
df.describe()

             Age
count   4.000000
mean   29.500000
std     4.203173
min    25.000000
25%    27.250000
50%    29.000000
75%    31.250000
max    35.000000

In [6]:
df.columns

Index(['Name', 'Age', 'City', 'Employed'], dtype='object')

In [7]:
df.shape

(4, 4)

In [8]:
df['Age']

0    25
1    30
2    35
3    28
Name: Age, dtype: int64

In [9]:
df[['Name', 'Age']]

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    Diana   28

In [10]:
filtered = df[df['Age']>=30]

In [11]:
filtered

      Name  Age           City  Employed
1      Bob   30  San Francisco     False
2  Charlie   35        Chicago      True

In [12]:
filt = df[(df["Age"]>=30) & (df['Employed'] == True)]

In [13]:
filt

      Name  Age     City  Employed
2  Charlie   35  Chicago      True

In [14]:
x = 100
y = 100
print(x is y)  # ✅ True (small integer, interned)

x = 1000
y = x
print(x is y)  # ❌ Might be False (not guaranteed to be interned)

True
True

In [16]:
df["Salary"] = [1000,2000,3000,4000]

In [17]:
df

      Name  Age           City  Employed  Salary
0    Alice   25       New York      True    1000
1      Bob   30  San Francisco     False    2000
2  Charlie   35        Chicago      True    3000
3    Diana   28    Los Angeles      True    4000

In [18]:
df.insert(5,'Bonus', df["Salary"]*0.1)

In [19]:
df

      Name  Age           City  Employed  Salary  Bonus
0    Alice   25       New York      True    1000  100.0
1      Bob   30  San Francisco     False    2000  200.0
2  Charlie   35        Chicago      True    3000  300.0
3    Diana   28    Los Angeles      True    4000  400.0

In [25]:
df.loc[2,'Salary']= 8000

In [29]:
df.drop(columns=['Bonus'], inplace=True)

In [30]:
df

      Name  Age           City  Employed  Salary
0    Alice   25       New York      True    1000
1      Bob   30  San Francisco     False    2000
2  Charlie   35        Chicago      True    8000
3    Diana   28    Los Angeles      True    4000

In [41]:
import pandas as pd
import numpy as np

# Create a sample DataFrame with missing values
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve'],
    'Age': [25, np.nan, 35, 28, np.nan],
    'City': ['New York', 'San Francisco', np.nan, 'Los Angeles', 'Chicago'],
    'Salary': [70000, 80000, np.nan, 72000, 68000]
}

df = pd.DataFrame(data)

print(df)

      Name   Age           City   Salary
0    Alice  25.0       New York  70000.0
1      Bob   NaN  San Francisco  80000.0
2  Charlie  35.0            NaN      NaN
3    Diana  28.0    Los Angeles  72000.0
4      Eve   NaN        Chicago  68000.0

In [42]:
df

      Name   Age           City   Salary
0    Alice  25.0       New York  70000.0
1      Bob   NaN  San Francisco  80000.0
2  Charlie  35.0            NaN      NaN
3    Diana  28.0    Los Angeles  72000.0
4      Eve   NaN        Chicago  68000.0

In [43]:
df.isnull().sum()

Name      0
Age       2
City      1
Salary    1
dtype: int64

In [39]:
df.dropna(axis=0, inplace=True)

In [40]:
df

    Name   Age         City   Salary
0  Alice  25.0     New York  70000.0
3  Diana  28.0  Los Angeles  72000.0

In [46]:
df['Age'].fillna(df["Age"].mean(), inplace=True)

In [47]:
df

      Name        Age           City   Salary
0    Alice  25.000000       New York  70000.0
1      Bob  29.333333  San Francisco  80000.0
2  Charlie  35.000000            NaN      NaN
3    Diana  28.000000    Los Angeles  72000.0
4      Eve  29.333333        Chicago  68000.0

In [48]:
df["Salary"].interpolate(method='linear', inplace=True)

In [49]:
df

      Name        Age           City   Salary
0    Alice  25.000000       New York  70000.0
1      Bob  29.333333  San Francisco  80000.0
2  Charlie  35.000000            NaN  76000.0
3    Diana  28.000000    Los Angeles  72000.0
4      Eve  29.333333        Chicago  68000.0

In [51]:
df["City"].fillna(df["City"].mode(), inplace=True)

In [52]:
df

      Name        Age           City   Salary
0    Alice  25.000000       New York  70000.0
1      Bob  29.333333  San Francisco  80000.0
2  Charlie  35.000000       New York  76000.0
3    Diana  28.000000    Los Angeles  72000.0
4      Eve  29.333333        Chicago  68000.0

In [53]:
df.sort_values(by='Age',ascending=False)

      Name        Age           City   Salary
2  Charlie  35.000000       New York  76000.0
1      Bob  29.333333  San Francisco  80000.0
4      Eve  29.333333        Chicago  68000.0
3    Diana  28.000000    Los Angeles  72000.0
0    Alice  25.000000       New York  70000.0

In [54]:
df.sort_values(by=['Age','Name'],ascending=[False, False])

      Name        Age           City   Salary
2  Charlie  35.000000       New York  76000.0
4      Eve  29.333333        Chicago  68000.0
1      Bob  29.333333  San Francisco  80000.0
3    Diana  28.000000    Los Angeles  72000.0
0    Alice  25.000000       New York  70000.0

In [55]:
avg_sal = df["Salary"].mean()

In [56]:
avg_sal

73200.0

In [57]:
df.groupby('City')['Salary'].sum()

City
Chicago           68000.0
Los Angeles       72000.0
New York         146000.0
San Francisco     80000.0
Name: Salary, dtype: float64